#include <stdio.h>

int main(int argc, char *argv[]) {
  puts(
      "在计算机内存中，整数一律采用补码的形式来存储。\n"
      "这意味着，当读取整数时还要采用逆向的转换，也就是将补码转换为原码。\n"
      "将补码转换为原码也很简单：先减去 1，再将数值位取反即可。\n"
      "负数在存储之前要先转换为补码。\n"
  );

  int a = -0x1; // 十六进制
  puts(
      "a = -0x1 详细分解：\n"
      "  = [1000 0000 0000 0000 0000 0000 0000 0001]原\n"
      "  = [1111 1111 1111 1111 1111 1111 1111 1110]反\n"
      "  = [1111 1111 1111 1111 1111 1111 1111 1111]补\n"
      "  = [0xffffffff]补"
  );

  // %#x 表示以无符号的形式输出，而无符号数的补码和原码相同，所以不用转换了，直接输出 0xffffffff 即可
  printf("a = %d\n", a);
  printf("a = %#x\n", a);
  puts("");

  unsigned long c = 0x80000000; // 十六进制
  puts(
      "c = 0x80000000 详细分解：由于 %d 表示以有符号的形式输出，所以还要经过一个逆向的转换过程\n"
      "  = [1000 0000 0000 0000 0000 0000 0000 0000]补\n"
      "  = [1111 1111 1111 1111 1111 1111 1111 1111]反\n"
      "  = [1000 0000 0000 0000 0000 0000 0000 0000]补\n"
      "  = [-2^31]整型\n"
      "  = [-2147483648]整型"
  );
  printf("c = %d\n", c);
  printf("c = %#lx\n", c);
  return 0;
}
