#include <stdio.h>

int main(int argc, char *argv[]) {
  puts("%-5d 中，d 表示以十进制输出，5 表示最少占 5 个字符的宽度，宽度不足以空格补齐，\n"
       "- 表示左对齐。综合起来，%-5d 表示以十进制输出，左对齐，宽度最小为 5 个字符。\n");
  printf("%-10s %-10s\n", "字符", "含义");
  printf("%-10s %-10s\n", "中杠", "即 -，表示示左对齐。如果没有，就按照默认的对齐方式，默认一般为右对齐");
  printf("%-10s %-10s\n", "加号", "即 +，用于整数或者小数，表示输出符号（正负号）。如果没有，那么只有负数才会输出符号");
  printf("%-10s %-10s\n", "空格", "即  ，用于整数或者小数，输出值为正时冠以空格，为负时冠以负号");
  printf("%-10s %-10s\n", "井号",
         "即 #，对于八进制（%o）和十六进制（%x / %X）整数，# 表示在输出时添加前缀；八进制的前缀是 0，十六进制的前缀是 "
         "0x / 0X");
  printf("%-10s %-10s\n", "井号",
         "即 #，对于小数（%f / %e / %g），# 表示强迫输出小数点。如果没有小数部分，默认是不输出小数点的，加上 # "
         "以后，即使没有小数部分也会带上小数点");
  puts("");

  int i = 12345, j = 89, k = 224, t = 12;
  float l = 1.123456, m = 9.88, n = 8989;
  double p = 3.141592653589793, q = 0.1234;
  char ch1 = '@', ch2 = '#';
  char *str1 = "hello world, hello c!";
  char *str2 = "格式化输出";

  printf("%-10d %-15.2f %-10d\n", i, l, t);
  printf("%-10d %-15.3f %-10d\n", k, m, j);
  printf("%-10c %-15.4f %-10s\n", ch1, n, str1);
  printf("%-10c %-15.5lf %-10s\n", ch2, p, str2);
  printf("%-10d %-15.10lf %-10s\n", t, q, str1);
  printf("%-10.0f %#-15.0lf %-10s\n", m, m, str1);

  return 0;
}
