#include <stdio.h>

/**
 * 三字符序列。
 *
 * 三字符组（Trigraph）与双字符组（Digraph）是程序设计语言（如 C 语言）中 3 个或者 2 个字符的序列，
 * 在编译器预扫描源程序时被替换为单个字符。以解决某些键盘不能输入某些编程必须的字符问题。
 *
 * 双字符组（仅 6 个）：
 * 1. <:   -> [
 * 2. :>   -> ]
 * 3. <%   -> {
 * 4. %>   -> }
 * 5. %:   -> #
 * 6. %:%: -> ##
 *
 * 三字符组（仅 9 个）：为了兼容，C++ 仍支持这些字符。编译器会用对应的字符替代所有三字符序列，再对源代码进行其他处理。
 * 1. ??= -> #
 * 2. ??( -> [
 * 3. ??) -> ]
 * 4. ??/ -> /
 * 5. ??< -> {
 * 6. ??> -> }
 * 7. ??' -> ^
 * 8. ??! -> |
 * 9. ??- -> ~
 */
int main(int argc, char *argv[]) {
  // 输出依赖于具体的编译器
  char *arr1[] = {"<:", ":>", "<%", "%>", "%:", "%:%:"};
  for (int i = 0; i < 6; i++) { printf("arr1[%d] = %s\n", i, arr1[i]); }

  printf("\n");

  char *arr2[] = {"??=", "??(", "??)", "??/", "??<", "??>", "??'", "??!", "??-"};
  for (int i = 0; i < 9; i++) { printf("arr2[%d] = %s\n", i, arr2[i]); }
  return 0;
}
